In [1]:
import pandas as pd
import numpy as np

In [5]:
# pd.Series(data)
a = ["hello","world","apple",'banana',"cherry","grapes","python"]
s = pd.Series(a)
print(type(s))

<class 'pandas.core.series.Series'>

In [8]:
print(s)

0     hello
1     world
2     apple
3    banana
4    cherry
5    grapes
6    python
dtype: object

In [7]:
print(s.axes)

[RangeIndex(start=0, stop=7, step=1)]

In [9]:
print(s.dtype)

object

In [10]:
print(s.empty)

False

In [11]:
s1 = pd.Series()

c:\users\himanshu.singhal01\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [13]:
s1

Series([], dtype: float64)

In [14]:
print(s1.empty)

True

In [15]:
print(s.ndim)

1

In [16]:
print(s.size)

7

In [18]:
print(type(s.values))

<class 'numpy.ndarray'>

In [19]:
print(s.values)

['hello' 'world' 'apple' 'banana' 'cherry' 'grapes' 'python']

In [20]:
print(s.head(3))

0    hello
1    world
2    apple
dtype: object

In [21]:
print(s.tail(3))

4    cherry
5    grapes
6    python
dtype: object

In [22]:
print(s.head())
print(s.tail())

0     hello
1     world
2     apple
3    banana
4    cherry
dtype: object
2     apple
3    banana
4    cherry
5    grapes
6    python
dtype: object

In [23]:
d = {"one":"Apple", "two":"Banana", "three":"Grapes"}
s2 = pd.Series(d)
print(s2)

one       Apple
two      Banana
three    Grapes
dtype: object

In [24]:
s2.axes

[Index(['one', 'two', 'three'], dtype='object')]

In [26]:
s3 = pd.Series(['one', 'two', 'three'], index=["Hello","World","Python"]) #index is used to pass the axes of the Series
print(s3)

Hello       one
World       two
Python    three
dtype: object

In [27]:
print(s[3])

banana

In [28]:
print(s[[3,4,6]])

3    banana
4    cherry
6    python
dtype: object

In [29]:
print(s3["Hello"])

one

In [30]:
print(s3[["Hello","Python"]])

Hello       one
Python    three
dtype: object

In [37]:
d = {
    "First": [10,20,30,40],
    "Second": [100.0,200.0,300.0,np.nan], #nan -> not a number -> null
    "Third": ["Hello","Python","World","Snake"]
}
df = pd.DataFrame(d)
print(df)

   First  Second   Third
0     10   100.0   Hello
1     20   200.0  Python
2     30   300.0   World
3     40     NaN   Snake

In [38]:
df1 = pd.DataFrame(d, columns=["A","B","C"])

In [40]:
print(df1)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [72]:
l = [[10,20,30,40],[100.0,200.0,300.0,np.nan],["Hello","Python","World","Snake"]]
df2 = pd.DataFrame(l, columns=["A","B","C","D"], index=["FIRST","SECOND","THIRD"])
df2

            A       B      C      D
FIRST      10      20     30     40
SECOND    100     200    300    NaN
THIRD   Hello  Python  World  Snake

In [43]:
print(df.axes)

[RangeIndex(start=0, stop=4, step=1),
 Index(['First', 'Second', 'Third'], dtype='object')]

In [46]:
df.dtypes

First       int64
Second    float64
Third      object
dtype: object

In [47]:
df.empty

False

In [48]:
df

   First  Second   Third
0     10   100.0   Hello
1     20   200.0  Python
2     30   300.0   World
3     40     NaN   Snake

In [49]:
df.T

            0       1      2      3
First      10      20     30     40
Second    100     200    300    NaN
Third   Hello  Python  World  Snake

In [50]:
df.ndim

2

In [51]:
df.size

12

In [52]:
df.shape

(4, 3)

In [53]:
df.values

array([[10, 100.0, 'Hello'],
       [20, 200.0, 'Python'],
       [30, 300.0, 'World'],
       [40, nan, 'Snake']], dtype=object)

In [67]:
df.sample(2)

   First  Second  Third
0     10   100.0  Hello
2     30   300.0  World

In [68]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [69]:
df

   First  Second   Third
0     10   100.0   Hello
1     20   200.0  Python
2     30   300.0   World
3     40     NaN   Snake

In [70]:
df['Fourth'] = [2,4,6,8]

In [71]:
df

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [74]:
df2.index

Index(['FIRST', 'SECOND', 'THIRD'], dtype='object')

In [76]:
df3 = df.set_index("Fourth")
df3

        First  Second   Third
Fourth
2          10   100.0   Hello
4          20   200.0  Python
6          30   300.0   World
8          40     NaN   Snake

In [77]:
df3.values

array([[10, 100.0, 'Hello'],
       [20, 200.0, 'Python'],
       [30, 300.0, 'World'],
       [40, nan, 'Snake']], dtype=object)

In [79]:
print(type(df['Third']))

<class 'pandas.core.series.Series'>

In [80]:
print(df['Third'])

0     Hello
1    Python
2     World
3     Snake
Name: Third, dtype: object

In [81]:
df.describe()

           First  Second    Fourth
count   4.000000     3.0  4.000000
mean   25.000000   200.0  5.000000
std    12.909944   100.0  2.581989
min    10.000000   100.0  2.000000
25%    17.500000   150.0  3.500000
50%    25.000000   200.0  5.000000
75%    32.500000   250.0  6.500000
max    40.000000   300.0  8.000000

In [82]:
df.sum()

First                       100
Second                      600
Third     HelloPythonWorldSnake
Fourth                       20
dtype: object

In [84]:
df.mean()

First      25.0
Second    200.0
Fourth      5.0
dtype: float64

In [87]:
df.median()

First      25.0
Second    200.0
Fourth      5.0
dtype: float64

In [88]:
df.std()

First      12.909944
Second    100.000000
Fourth      2.581989
dtype: float64

In [89]:
df.count()

First     4
Second    3
Third     4
Fourth    4
dtype: int64

In [90]:
df.cumsum()

   First  Second                  Third  Fourth
0     10   100.0                  Hello       2
1     30   300.0            HelloPython       6
2     60   600.0       HelloPythonWorld      12
3    100     NaN  HelloPythonWorldSnake      20

In [91]:
df['First'].mean()

25.0

In [93]:
df

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [95]:
dfr = df.reindex(columns=['First','Third'], index=[1,2])
dfr

   First   Third
1     20  Python
2     30   World

In [97]:
dfrr = df.reindex(columns=['Fourth', 'Third','First','Second'])
dfrr

   Fourth   Third  First  Second
0       2   Hello     10   100.0
1       4  Python     20   200.0
2       6   World     30   300.0
3       8   Snake     40     NaN

In [98]:
dfi = df.reindex(columns=['Fifth', 'First'])
dfi

   Fifth  First
0    NaN     10
1    NaN     20
2    NaN     30
3    NaN     40

In [99]:
df

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [109]:
dfrn = df.rename(columns = {"First":"A","Third":"B"}) #{"old_col_name":"new_col_name"}
dfrn

    A  Second       B  Fourth
0  10   100.0   Hello       2
1  20   200.0  Python       4
2  30   300.0   World       6
3  40     NaN   Snake       8

In [110]:
df

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [111]:
for k,v in df.iteritems():
    print(k,"--->>>",v)

First --->>> 0    10
1    20
2    30
3    40
Name: First, dtype: int64
Second --->>> 0    100.0
1    200.0
2    300.0
3      NaN
Name: Second, dtype: float64
Third --->>> 0     Hello
1    Python
2     World
3     Snake
Name: Third, dtype: object
Fourth --->>> 0    2
1    4
2    6
3    8
Name: Fourth, dtype: int64

In [112]:
for k,v in df.iterrows():
    print(k,"--->>>",v)

0 --->>> First        10
Second      100
Third     Hello
Fourth        2
Name: 0, dtype: object
1 --->>> First         20
Second       200
Third     Python
Fourth         4
Name: 1, dtype: object
2 --->>> First        30
Second      300
Third     World
Fourth        6
Name: 2, dtype: object
3 --->>> First        40
Second      NaN
Third     Snake
Fourth        8
Name: 3, dtype: object

In [113]:
for k in df.itertuples():
    print(k)

Pandas(Index=0, First=10, Second=100.0, Third='Hello', Fourth=2)
Pandas(Index=1, First=20, Second=200.0, Third='Python', Fourth=4)
Pandas(Index=2, First=30, Second=300.0, Third='World', Fourth=6)
Pandas(Index=3, First=40, Second=nan, Third='Snake', Fourth=8)

In [114]:
df

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [115]:
dfa = df.reindex(index=[3,1,0,2])
dfa

   First  Second   Third  Fourth
3     40     NaN   Snake       8
1     20   200.0  Python       4
0     10   100.0   Hello       2
2     30   300.0   World       6

In [117]:
sdf = dfa.sort_index()
print(sdf)

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [120]:
dfa

   First  Second   Third  Fourth
3     40     NaN   Snake       8
1     20   200.0  Python       4
0     10   100.0   Hello       2
2     30   300.0   World       6

In [118]:
ssdf = dfa.sort_values('Fourth')
ssdf

   First  Second   Third  Fourth
0     10   100.0   Hello       2
1     20   200.0  Python       4
2     30   300.0   World       6
3     40     NaN   Snake       8

In [119]:
dsdf = dfa.sort_values('Fourth', ascending=False)
dsdf

   First  Second   Third  Fourth
3     40     NaN   Snake       8
2     30   300.0   World       6
1     20   200.0  Python       4
0     10   100.0   Hello       2

In [2]:
df = pd.DataFrame(np.random.randn(4,3),columns = ['A','B','C'])
df

          A         B         C
0 -0.221356  1.137564  2.072021
1 -0.658644 -0.125432 -0.880797
2  0.215900  1.382124  0.970020
3  0.695345 -1.107072 -0.826689

In [4]:
df['C']

0    2.072021
1   -0.880797
2    0.970020
3   -0.826689
Name: C, dtype: float64

In [5]:
# df.loc[rows,cols] -> string based access
# df.iloc[rows,cols] -> integer based access
# df.ix[rows,cols] -> string,integer based access

print(df.loc[:,'C'])

0    2.072021
1   -0.880797
2    0.970020
3   -0.826689
Name: C, dtype: float64

In [6]:
print(df.loc[:,['B','C']])

          B         C
0  1.137564  2.072021
1 -0.125432 -0.880797
2  1.382124  0.970020
3 -1.107072 -0.826689

In [7]:
print(df.iloc[:,0])

0   -0.221356
1   -0.658644
2    0.215900
3    0.695345
Name: A, dtype: float64

In [8]:
print(df.iloc[:,[0,2]])

          A         C
0 -0.221356  2.072021
1 -0.658644 -0.880797
2  0.215900  0.970020
3  0.695345 -0.826689

In [15]:
print(df.iloc[1:4,[0,2]])

          A         C
1 -0.658644 -0.880797
2  0.215900  0.970020
3  0.695345 -0.826689

In [10]:
print(df.iloc[1,0])

-0.658643550283406

In [13]:
print(pd.__version__)

1.1.5

In [18]:
"""temp -> 10*, 15*, 25*
sales of cold items -> 100, 200, 500
sales of hot items -> 300, 200, 100
sale of Shirt -> 100, 100, 100

effect of one variable makes effect on another variable

covariance (Basic)-> 
correlation (Advanced)-> """

df = pd.DataFrame({'Name':["Ram","Shyam","Sita","Geeta"], "Marks":[10,20,15,40]})
df

    Name  Marks
0    Ram     10
1  Shyam     20
2   Sita     15
3  Geeta     40

In [20]:
df['Marks'].pct_change()

0         NaN
1    1.000000
2   -0.250000
3    1.666667
Name: Marks, dtype: float64

In [22]:
d = {
    'temp': [10, 15, 25],
    'cold': [100, 200, 500],
    'hot': [300, 200, 100],
    'Shirt': [100, 100, 100]
}
df = pd.DataFrame(d)
df

   temp  cold  hot  Shirt
0    10   100  300    100
1    15   200  200    100
2    25   500  100    100

In [26]:
print(df['temp'].corr(df['cold']))

0.9958705948858224

In [27]:
print(df['temp'].corr(df['hot']))

-0.9819805060619657

In [29]:
print(df['temp'].corr(df['Shirt']))

nan

In [30]:
s = pd.Series([1,2,3,1,2,4,21,3,5,6,1,4,7,4,8,1,7,9,2,1])
s.mode()

0    1
dtype: int64

In [31]:
df

   temp  cold  hot  Shirt
0    10   100  300    100
1    15   200  200    100
2    25   500  100    100

In [32]:
print(df['temp'].sum())
print(df['cold'].mean())
print(df['hot'].prod())
print(df['cold'].sum())

50
266.6666666666667
6000000
800

In [33]:
df.agg(np.sum)

temp      50
cold     800
hot      600
Shirt    300
dtype: int64

In [34]:
df[['temp','hot']].aggregate(np.mean)

temp     16.666667
hot     200.000000
dtype: float64

In [35]:
df[['temp','hot']].aggregate([np.mean, np.sum])

           temp    hot
mean  16.666667  200.0
sum   50.000000  600.0

In [36]:
df.aggregate({'temp':np.mean, 'hot':np.sum})

temp     16.666667
hot     600.000000
dtype: float64

In [41]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)

In [42]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [43]:
g = df.groupby('Team')
print(g)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002639903C4A8>

In [44]:
print(g.groups)

{'Devils': [2, 3], 'Kings': [4, 5, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10]}

In [45]:
for gn, gv in g:
    print(gn)
    print(gv)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [46]:
g.get_group('Riders')

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

In [48]:
g['Points'].agg(np.sum)

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [49]:
g2 = df.groupby(['Team','Year'])
g2.groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2015): [5], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

In [50]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

print(left)
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [51]:
m = pd.merge(left, right, how='inner', on='subject_id')

In [52]:
print(m)

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [53]:
m = pd.merge(left, right, how='left', on='subject_id')
m

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [54]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id1':['sub2','sub4','sub3','sub6','sub5']})

In [55]:
m = pd.merge(left, right, how='inner', left_on='subject_id', right_on='subject_id1')
m

   id_x  Name_x subject_id  id_y Name_y subject_id1
0     2     Amy       sub2     1  Billy        sub2
1     3   Allen       sub4     2  Brian        sub4
2     4   Alice       sub6     4  Bryce        sub6
3     5  Ayoung       sub5     5  Betty        sub5

In [56]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [62]:
# filtering / logical indexing
rgt2 = df[(df['Rank']>1) & (df['Rank']<4)]
rgt2

      Team  Rank  Year  Points
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
8   Riders     2  2016     694
11  Riders     2  2017     690

In [64]:
df = pd.read_csv('revised.csv')
print(type(df))
df.sample(10)

<class 'pandas.core.frame.DataFrame'>

        time_ref  account    code country_code product_type      value status
654265    202003  Imports    4901           HK        Goods   784294.0      F
525036    202009  Exports    8431           RS        Goods     6078.0      F
248306    202112  Exports  A12101           CN     Services   287000.0      F
124614    202206  Exports      61           IS        Goods      479.0      F
150138    202206  Imports    5406           FR        Goods      650.0      F
151327    202206  Imports    6002           CN        Goods    11620.0      F
206332    202203  Imports    6104           HK        Goods    32727.0      F
249663    202112  Imports    0401           AU        Goods   187057.0      F
353036    202106  Exports    7419           WS        Goods     3242.0      F
27468     202212  Imports    2008           IN        Goods  2172382.0      F

In [73]:
df['country_code'].value_counts().head(10)

AU    25946
US    22168
CN    19560
GB    17909
DE    16208
JP    15564
IN    13478
FR    13253
IT    13196
TW    13163
Name: country_code, dtype: int64

In [66]:
df['status'].value_counts()

F    608446
C     36284
R     30768
Name: status, dtype: int64

In [67]:
df['value'].sum()

3335695210036.3496

In [68]:
df['value'].mean()

5218432.653284111

In [71]:
df['country_code'].mode()

0    AU
dtype: object

In [72]:
df.describe()

            time_ref         value
count  675498.000000  6.392140e+05
mean   202107.758321  5.218433e+06
std        81.588485  1.772932e+08
min    202003.000000 -8.802204e+08
25%    202012.000000  2.383000e+03
50%    202109.000000  2.231100e+04
75%    202206.000000  2.037228e+05
max    202212.000000  2.409993e+10

In [74]:
df['country_code'].str.lower().head()

0    ad
1    ae
2    ag
3    am
4    ao
Name: country_code, dtype: object

In [75]:
df['account'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
675493    False
675494    False
675495    False
675496    False
675497    False
Name: account, Length: 675498, dtype: bool

In [76]:
df[df['account'].isnull() == True]

Empty DataFrame
Columns: [time_ref, account, code, country_code, product_type, value, status]
Index: []

In [77]:
df[df['value'].isnull() == True]

        time_ref  account    code country_code product_type  value status
20773     202212  Exports     A12           AQ     Services    NaN      C
20795     202212  Exports     A12           BW     Services    NaN      C
20812     202212  Exports     A12           CW     Services    NaN      C
20814     202212  Exports     A12           CY     Services    NaN      C
20818     202212  Exports     A12           DK     Services    NaN      C
...          ...      ...     ...          ...          ...    ...    ...
675420    202003  Imports  A12122           ID     Services    NaN      C
675422    202003  Imports  A12122           IR     Services    NaN      C
675446    202003  Imports  A12122           VU     Services    NaN      C
675463    202003  Imports  A12123           EG     Services    NaN      C
675464    202003  Imports  A12123           ES     Services    NaN      C

[36284 rows x 7 columns]

In [78]:
df['value'].mean()

5218432.653284111

In [79]:
dff = df[df['value'].isnull() == True].fillna(5218432.65)

In [81]:
dff[dff['value'].isnull() == True]

Empty DataFrame
Columns: [time_ref, account, code, country_code, product_type, value, status]
Index: []

In [83]:
df.dropna(inplace=True)
print(df[df['value'].isnull() == True])

Empty DataFrame
Columns: [time_ref, account, code, country_code, product_type, value, status]
Index: []

In [2]:
#to_csv(file_name, index=True, header=True, sep=',')
df = pd.DataFrame(np.random.randn(4,3), columns=['A','B','C'])
df

          A         B         C
0 -0.199581 -0.680190  0.386721
1 -0.031884 -0.236314 -0.947806
2 -0.068711  1.395489 -1.705466
3  1.673758  0.749469  0.932924

In [7]:
df.to_csv("out1.csv", index=False, header=False, sep="&")